[{"title": "Senior Software Engineer", "id": "de8810e65eead281", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "Monster Worldwide, Inc.", "id": "1", "logo": null}, "positions": [], "salary": null, "datePosted": null, "dateExpiring": null, "description": "–Senior Software Engineer\n\nWe are looking for a Senior S oftware E ngineer to work on a new project that merges recruitment with advertising technology . Working with product management, collaborating with world - wide development squads in an agile environment, you will work on features that have an impact on job seekers, recruiters, and employers to match the right candidate to the right job.\n\nMonster is transforming. We are modernising our platform and services to simplify the process of finding the right candidate for the right job. We want it to be a rewarding experience for all involved.\n\nAt Monster, you will be part of an agile team that value innovative thinking, collaboration, and knowledge sharing. These are exciting times! Join us on the journey as we transform the future of connecting people and jobs.\n\nMain responsibilities:\nParticipate in application development and prototyping using multiple technologies\nDevelop solutions in agile environment for all tiers of the applications Investigate and analyse reported defects and recommend solutions to these problems including code changes, data updates, or configuration modifications Work in a co-located scrum team Work with Amazon AWS services, and GCP\nConduct and assist in integration testing Actively participate and initiate continuous improvement of the Monster platform\n\nKey technica l skills :\n4+ years in Object Oriented or Functional Programming experience\nExperience in Microservice s architecture Cloud experience such as Amazon Web Services or Google Cloud Platform\n\nOther relevant skills:\nSelf-motivated with time management skills to work in 2 week sprints\nA bility to work both autonomously and within a team Experience in advertising technology\n\nSkills\n\nScala, Kotlin , Microservices, AWS, GCP , Agile , SEO , Elasticsearch, DynamoDb , Reactive programming\n\nQualification\nRelevant tertiary qualifications\n\nEducational Requirements\nBachelor’s degree in computing science or related technical field", "location": {"suburb": "Sydney", "state": "NSW", "postcode": null, "description": null}, "link": "https://au.indeed.com/viewjob?jk=de8810e65eead281", "reference": "indeed", "activeStatus": true, "categories": []}, {"title": "Consultant", "id": "b133955982d37e45", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "IRI APAC", "id": "1", "logo": null}, "positions": [], "salary": null, "datePosted": null, "dateExpiring": null, "description": "IRI is powered by people\nWe're a fast paced, tech driven and people focused business. Innovation and entrepreneurism are part of our core DNA. We like to create, and we like to make things happen. Our team is diverse and is made up of Insight and Industry Consulting Analysts, Data Scientists, Product Managers, Solution Architects, Software Engineers and Change Specialists.\nAs an organisation we're leading the charge as the specialist provider of data-driven, insight and consulting solutions for FMCG retailers and manufacturing sector.\nWe power over 500+ leading Australian businesses with a number of services and solutions including;\nClient consulting services for the retail, grocery, liquor, tobacco and pharmaceutical sectors\nPerformance data processing and solutions for the FMCG sector\nConsumer shopper, loyalty and analytics programs\nSoftware development and cloud-based reporting platforms\nSo why IRI?\nWe're progressive, inclusive and people focused. We seek to create a down to earth culture which balances work and home life and enables our team to be the best that it can be. Our people are important to us and we offer a number of fantastic benefits including;\nFlexible working both on and off-site\nEmployee training and continuous development programs\nWomen in leadership accelerated development opportunities\n5 weeks annual leave and holiday buy back scheme\nPaid maternity and paternity leave\nBirthday leave\nSummer half day Fridays\nWhat are your key responsibilities as an Insights Consultant?\nDefine business problems through consultations with clients and provide solutions to their business needs\nSolve briefs with actionable recommendations through incorporating analyses from different data sources\nProvide and present insights through storytelling\nLead client relationships and proactively develop these relationships to deliver against account plan objectives\nTake a lead role in business development activities\nWhat are we looking for?\nAt least 3 years FMCG experience in data and insights, particularly using scan, continuous shopper panel or loyalty data\nAbility to communicate and influence senior stakeholders\nA confident and assertive nature\nStrong commercial acumen with the ability to identify business development opportunities\nEffective communication and presentation skills\nAbility to build and maintain successful client relationships", "location": {"suburb": "Sydney", "state": "NSW", "postcode": null, "description": null}, "link": "https://au.indeed.com/viewjob?jk=b133955982d37e45", "reference": "indeed", "activeStatus": true, "categories": []}, {"title": "Software Engineer", "id": "062bd611f9984bc6", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "Assignar", "id": "1", "logo": null}, "positions": [], "salary": null, "datePosted": null, "dateExpiring": null, "description": "Assignar\nInfrastructure and construction sectors are booming and we are growing rapidly with it. At Assignar we are at the forefront of digitisation within the construction industry providing a SaaS platform for the planning and optimisation of construction operations. Assignar's data-driven technology makes our customers' construction work more efficient and more profitable. If you share our passion for building things and explaining how stuff works, you should definitely consider joining our fully remote team!\nSoftware Engineer\nWe are expanding our engineering team and are looking for Software Engineers to join us and have a high impact. We are a group of technically skilled humans that have a strong bias for action, an emphasis on product, customer experience and love pushing the boundaries using technical innovations.\nYou will play a big role in solving problems that our customers are facing, architecting and implementing solutions that will catapult Assignar to the industry standard both in ConstructionTech and Software Development.\nSkills we are looking for:\nExperience building complex SaaS applications\nMinimum 2 years of Software Development experience in web or mobile application development\nExperience of JavaScript, using a modern front-end framework and/or a mainstream backend language/framework too\nStrong understanding of SQL and NoSQL databases\nPractical programming skills allowing you to debug complex problems\nAppreciates and is committed to maintaining a cohesive and collaborative team culture through positive reinforcement and supportive feedback\nA continuous learner who loves to work with cutting edge technologies, welcoming change and enjoys working in a dynamic environment\nMotivated to share knowledge and best-practices to improve others' abilities around them\nExcellent written and verbal communication skills\nThese skills would be a huge bonus:\nGraphQL & Django\nReactJS, Typescript, Apollo\nAWS services & Github Actions\nDomain Driven Design\nExperience developing mobile applications\nSoftware Engineering, Computer Science or a similar university degree\nWe enable cross-functional development and empower teams to solve any problems that arise. Therefore, we are searching for someone who is willing to learn, advance all areas of their skillset and grow in other areas of the product.\nAt Assignar we aim to hire passionate, smart and inspiring individuals who want to be a part of building not only a great product but are keen to nurture and add to our incredible culture. High value is placed upon cultivating a friendly, collaborative and inclusive work environment where employees bring out the best in each other.", "location": {"suburb": "Remote", "state": null, "postcode": null, "description": null}, "link": "https://au.indeed.com/viewjob?jk=062bd611f9984bc6", "reference": "indeed", "activeStatus": true, "categories": []}, {"title": "Silicon Engineer - 97221", "id": "a1271c98dffb5122", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "Advanced Micro Devices, Inc.", "id": "1", "logo": null}, "positions": [], "salary": null, "datePosted": null, "dateExpiring": null, "description": "What you do at AMD changes everything\n\nAt AMD, we push the boundaries of what is possible. We believe in changing the world for the better by driving innovation in high-performance computing, graphics, and visualization technologies – building blocks for gaming, immersive platforms, and the data center.\n\nDeveloping great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the “extra mile” to achieve unthinkable results. It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world. If you have this type of passion, we invite you to take a look at the opportunities available to come join our team.\n\n\nSILICON ENGINEER\n(Architecture / Micro-architecture and Modeling, Design, Design Verification\n\nTHE ROLE:\nYou will be part of a fast-paced team working on next generation GPU products. A team of varied disciplines who is responsible for architecture/micro-architecture of key graphics and compute features, architecture modeling, design and validation to deliver best in class graphics and compute products.\n\nIn an architecture/modeling role, you will be working very closely with the system architects (hardware and software) on defining and implementing key features in an architecture model to ensure performance goals are met.\n\nIn a design role, you will be working on defining/specifying the micro-architecture of next generation graphics features, RTL design capture, timing and power convergence. You will work closely with architects, power and physical design team to achieve PPA (power, performance, and area) goals.\n\nIn a DV role, you will be developing validation collaterals including testbenches (UVM and system verilog) and reference C-model. You will work with architecture, design and full chip validation/emulation teams to define, develop and execute test plans. You will be responsible for ensuring block is signed off meeting all quality metrics (function and code coverage, regression pass rate, test development) in addition to formal verification of key parts of the design (data path, clock gating and formal property FPV).\n\nNo idea is too small; we welcome every initiative that makes our product better. We challenge ourselves to improve current processes and methodologies and eager to adopt new ideas that would help improve IP quality and efficiency.\nTHE PERSON:\nIn order to be successful in this role, you will possess experience in the desired disciplines.\n\nKEY RESPONSIBILITIES:\nKey responsibilities for the various disciplines are highlighted above.\n\n PREFERRED EXPERIENCE:\nWe are seeking professionals with various levels of experience.\nACADEMIC CREDENTIALS:\nUndergraduate degree in related discipline.\n\nLOCATION:\nSydney, Australia\n\nRequisition Number: 97221\nCountry/Region/Location: Australia State/Province: New South Wales City: Sydney\nJob Function: Design\nHiring Manager: Naser Marmash", "location": {"suburb": "Sydney", "state": "NSW", "postcode": null, "description": null}, "link": "https://au.indeed.com/viewjob?jk=a1271c98dffb5122", "reference": "indeed", "activeStatus": true, "categories": []}, {"title": "Customer Support Engineer, APAC", "id": "4f145b74137e3386", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "Blue Prism", "id": "1", "logo": null}, "positions": [], "salary": null, "datePosted": null, "dateExpiring": null, "description": "SYDNEY: Blue Prism® is seeking an enthusiastic, motivated individual with excellent oral and written communication skills to join our team of highly skilled support staff. Primarily responsible for providing world class technical support to Blue Prism customers and partners. The role will be reporting to the Support Team Manager (Asia, Pacific and Japan). As our global customer base expands, the support analyst will also be required to work shift or on-call patterns to provide support for other time zones.\n\nRequirements\nResponsibilities would involve troubleshooting, analysing technical problems and working with customers and Blue Prism developers to resolve technical roadblocks. You will ensure all issues are resolved or escalated to the proper resources to resolve in a timely fashion. Additionally, you will manage communications with customers at all levels to maintain positive relationships.\nAdditional responsibilities include but are not limited to the following:\nManage customer support technical issues within our Support System on a daily basis, including verifying issues, isolating and diagnosing the problem, and resolving the issue where possible.\nProvide technical support to customers, partners, sales engineers and post-sales consultants via telephone, email and the web.\nReproduce product behaviour to determine the problem root-cause and to find work-arounds and solutions.\nAbility to ensure actions are followed-up in a timely manner and attention to detail.\nAbility to deal with difficult customer situations.\nCoordinate with other teams to provide assistance in identifying, reporting and resolving product defects.\nAuthor, edit, publish and maintain an on-line knowledge base of known issues/solutions.\nTechnical Skills and Experience\n\nHighly Desireable:\n3+ years of experience in a software support or development role.\nA high degree of analytical, trouble shooting and problem-solving abilities.\nKnowledge and ability to troubleshoot current Windows operating systems (WinXP onwards)\nUnderstanding of TCP/IP networks and security, LAN/WAN communication and configurations.\nExposure to basic programming skills with knowledge of VB /.NET/C# an advantage.\nThorough understanding of and ability to use Microsoft Office suite\nKnowledge of virtualization technologies (eg Citrix, VMware)\nExperience with one or more Blue Prism Technology Partner products, such as Appian, IBM Watson, ABBYY, Cyberark.\n\nDesirable:\nSQL programming skills and knowledge of SQL Server.\nWeb Development (eg. Java Script / HTML / HTML5 / PHP) skills\nData-interchange development (XML / Soap / JSON) skills\nGood formal documentation skills\n\nPerson Specification\nInitiative and ability to be productive without supervision\nExperience in support of software products to include derivation of workarounds and fixes.\nExcellent attention to detail with a passion for quality with strong written and oral communication skills\nAbility to recognize problems, gather facts, analyse information with strong deductive reasoning skills\nAbility to organize multiple work tasks and prioritize them to meet specific deadlines, work under own initiative and respond to peaks in demand\nAbility to quickly grasp and understand new tasks and ideas and to work well as part of a team\nPossess a strong desire for self-improvement and advancement with a strong and active interest in IT generally\nMust be ambitious and prepared to commit to a rapidly growing company through a period of considerable expansion\nAbility to work constructively together as a team, sharing ideas and resources.\nBe passionate about delivering high quality service to customers and partners, with a focus on continuous improvement.\nBenefits\nBlue Prism Software is an Equal Opportunity Employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, alienage or national origin, ancestry, citizenship status, age, disability or handicap, sex, marital status, veteran status, sexual orientation, gender identity or expression, genetics, arrest record or any other characteristic protected by applicable federal, state or local laws.\nBlue Prism is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Blue Prism via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Blue Prism. No fee will be paid in the event the candidate is hired by Blue Prism as a result of the referral or through other means.", "location": {"suburb": "Sydney", "state": "NSW", "postcode": null, "description": null}, "link": "https://au.indeed.com/viewjob?jk=4f145b74137e3386", "reference": "indeed", "activeStatus": true, "categories": []}, {"title": "Senior Consultant", "id": "2145d2b5bdd72dcb", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "IRI APAC", "id": "1", "logo": null}, "positions": [], "salary": null, "datePosted": null, "dateExpiring": null, "description": "IRI is powered by people\nWe're a fast paced, tech driven and people focused business. Innovation and entrepreneurism are part of our core DNA. We like to create, and we like to make things happen. Our team is diverse and is made up of Insight and Industry Consulting Analysts, Data Scientists, Product Managers, Solution Architects, Software Engineers and Change Specialists.\nAs an organisation we're leading the charge as the specialist provider of data-driven, insight and consulting solutions for FMCG retailers and manufacturing sector.\nWe power over 500+ leading Australian businesses with a number of services and solutions including;\nClient consulting services for the retail, grocery, liquor, tobacco and pharmaceutical sectors\nPerformance data processing and solutions for the FMCG sector\nConsumer shopper, loyalty and analytics programs\nSoftware development and cloud-based reporting platforms\nSo why IRI?\nWe're progressive, inclusive and people focused. We seek to create a down to earth culture which balances work and home life and enables our team to be the best that it can be. Our people are important to us and we offer a number of fantastic benefits including;\nFlexible working both on and off-site\nEmployee training and continuous development programs\nWomen in leadership accelerated development opportunities\n5 weeks annual leave and holiday buy back scheme\nPaid maternity and paternity leave\nBirthday leave\nSummer half day Fridays\nWhat are your key responsibilities as a Senior Consultant?\nDefine business problems through consultations with clients and provide solutions to their business needs\nSolve briefs with actionable recommendations through incorporating analyses from different data sources\nProvide and present insights through storytelling\nLead client relationships and proactively develop these relationships to deliver against account plan objectives\nTake a lead role in business development activities\nWhat are we looking for?\nAt least 5 years FMCG experience in data and insights, particularly using scan, continuous shopper panel or loyalty data\nAbility to communicate and influence senior stakeholders\nA confident and assertive nature\nStrong commercial acumen with the ability to identify business development opportunities\nEffective communication and presentation skills\nAbility to build and maintain successful client relationships", "location": {"suburb": "Melbourne", "state": "VIC", "postcode": null, "description": null}, "link": "https://au.indeed.com/viewjob?jk=2145d2b5bdd72dcb", "reference": "indeed", "activeStatus": true, "categories": []}, {"title": "Graduate Mechanical Engineer", "id": "9751a20726a9c915", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "Stantec", "id": "1", "logo": {"src": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/b9ba8b805eaa064846e1c3449a310dff", "alt": "Stantec logo"}}, "positions": [], "salary": null, "datePosted": null, "dateExpiring": null, "description": "18579BR\nRequisition Number:\n18579BR\nDescription:\nCommunities are fundamental. Whether around the corner or across the globe, they provide a foundation, a sense of place and of belonging. That's why at Stantec, we always design with community in mind.\nOne difference between Stantec and our competitors is that we have an emphasis on professional and personal development and will take steps to help you achieve your career goals. We also have a culture of delivering as a team and our Brisbane office has a healthy and vibrant culture. At Stantec you will be backed by a Global company but delivering at a local level.\nThe role\nStantec is a global leader in the water infrastructure sector. We implement technically innovative water and wastewater solutions to manage and meet increasingly complex regulatory and quality standards while focusing on sustainable and cost-effective options. We provide a full suite of integrated water, wastewater, stormwater, solid waste and general civil, engineering and management advisory services to meet the needs of our clients using the latest innovative industry research and global experience.\nKey accountabilities\n\\tCarry out site surveys, investigations and feasibility studies for proposed projects\n\\tAssist with collection and analysis of data and field samples as appropriate\n\\tProduce calculations, specifications and drawings to ensure that technical designs provide appropriate solution\n\\tSupport specific project including assisting with planning, co-ordination and report writing\n\\tAssist with communication and development ongoing contacts with clients as required\n\\tOrganise tender documents, assist in the evaluation of tenders and administration of contracts.\n\\tContribute to proposal and bid development to support business development activities, including preparing proposal material as required\n\\tComplete all work in line with Stantec Core Values and in accordance with the Stantec Quality, Safety & Environment Systems and Project Quality Procedures\n\\tMinimise and control risk by commitment to the Stantec Quality, Health & Safety programmes and ensuring proactive use of our project management systems\n\\tOther duties as reasonably required\nThe opportunity\nWe are looking for driven graduates to join our water engineering team based in our Brisbane office. You will join a team that works on water engineering projects, not only locally, but across Australia and the wider Asia Pacific region.\nWhat we offer\nAlong with a competitive salary we offer many other benefits to ensure your professional development & wellbeing is ongoing.\n\\tFlexible Working Arrangements including purchasing up to 4 weeks additional leave and provision for school term contracts\n\\tLearning and Talent Development Programs including Global programmes, online learning and on-the-job learning\n\\tMentoring for your own development and the opportunity to mentor others\n\\tProfessional Memberships\n\\tIncome Continuance Insurance (ICI)\n\\tService Recognition Awards\n\\tEmployee Assistance Program\nIt couldn't be easier beginning your career in engineering with Stantec. As an Engineers Australia Partner, we'll pay your membership fees and assist you along the path to registration. You'll have the chance to work on leading-edge projects, fully supported by our comprehensive graduate development program.\nTo be eligible to apply you should have\n\\tTertiary qualification in respective degree in Mechanical Engineering by December 2020;\n\\tBe eligible to work in Australia;\n\\tHave a full clean current driving licence\nIn addition, our preferred candidate will also\n\\tHave either work experience, or an interest in developing, water engineering technical expertise related to water supply and sewer networks, water and wastewater treatment plants, and bulk water supply for regional and urban water authorities.\n\\tBe driven to develop experience in dealing with a range of clients and stakeholders including local authorities, government bodies and commercial companies.\n\\tStrong self-management skills as you will need to be able to prioritize workloads whilst maintaining strong and trusting working relationships with our Clients' and colleague's both locally and across the broader Stantec team.\n\\tFlexibility is required as you could be asked to work from other offices at times including client secondments.\n\\tWillingness to work towards chartership is required.\nWe would also like you to\n\\tSupply details of your education and experience to date, including an academic transcript;\n\\tInclude a cover letter outlining why you are applying and why we should short list you for interview.\nTitle:\nGraduate Mechanical Engineer\nQualifications:\nTertiary qualification in Mechanical Engineering\nJob Category:\nMechanical Engineering\nAbout Stantec:\nWe’re active members of the communities we serve. That’s why at Stantec we always design with community in mind. We believe growing a great design company happens from the inside out. We look for people who are drawn to use every talent they possess, plus creativity, determination and a drive to do the extraordinary.\nThe Stantec community unites approximately 22,000 employees working in over 350 locations across six continents. We collaborate across disciplines and industries to bring projects to life. Our work as architects, engineers, and consultants from initial project concept and planning through design, construction and commissioning is built on a solid history of success. So, when we take on a project, we see the opportunity to make a lasting connection with the people and places where we live and work. Redefine your personal best. Join us!\nLocation :\nAustralia-Queensland Brisbane, Australia-Queensland Gold Coast\nCountry:\nAustralia\nState/Province:\nQueensland\nCity:\nBrisbane", "location": {"suburb": "Brisbane", "state": "QLD", "postcode": null, "description": null}, "link": "https://au.indeed.com/viewjob?jk=9751a20726a9c915", "reference": "indeed", "activeStatus": true, "categories": []}, {"title": "Sales Engineer - APJ", "id": "58c6b9f7879d8650", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "EnterpriseDB Corporation", "id": "1", "logo": null}, "positions": [], "salary": null, "datePosted": null, "dateExpiring": null, "description": "at EDB\nAustralia\n\nThe world loves Postgres. If you work with developers or data scientists or anyone wrangling data, you’ll probably see a sticker with the tusks and trunk of the Postgres elephant on the lid of a nearby laptop. EDB has a lot to do with that.\n\nWe’ve been major contributors to Postgres since the beginning, and we are proud to call thousands of boundary pushing customers our partners. Proud though we are, we are not resting on our laurels. There’s plenty of work to do. The good news is that everything we do will impact Postgres, which is to say that it will impact the world. No pressure.\n\nSales Engineer - APJ\n\nBased in the Sydney, Australia.\n\nResponsibilities:\nThis position will be responsible for driving growth and ongoing transformation of the APJ sales function to achieve critical business objectives. Interacting with customers/prospects/partners on a regular basis, hence it's not just a SE manager role.\nEngage with existing ANZ customers and business partners, providing EDB technical expertise to help clients solve business problems and grow the subscription and services business.\nProvide subject matter expertise to ensure that ANZ sales achieve their plan targets.\nWork with EDB professional services to build statement of work required in the deployment of EDB solutions\nAssist clients and partners to build training and enablement plans\nProvide leadership to all EDB SE's in Asia Pacific & Japan, including enablement plans and project support\nProvide single point of technical contact for IBM partner engagements in APJ, liaising with local EDB SE's to provide necessary tech support to IBM opportunities\nProvide EDB product management & engineering guidance on EDB product usage and performance in APJ. Also provide product management competitive information\n\nRequirements:\nThe SE should have customer-facing experience from previous roles with the ability to identify customer pain points just not in terms of database specific needs but the overall platform and data needs.\n\nAbility to drive discussions and database related pain-points at CXO level and provide guidance in order to drive them for more adoption of EDB Postgres. It would include competing with native cloud databases or working with the cloud service providers etc.\nPerform SE team management on a regular basis which includes team update calls, performance reviews, motivation and lead product orientation from the perspective of EDB selling motions specifically products, services and trainings.\nDefine the SE KPIs and guide, support individual SEs to achieve these KPIs.\nSupport key and strategic sales motions across APJ from a senior technical leadership perspective.\n\nMinimum Criteria/Qualification: Below basically descriptions for an SE so can be chosen accordingly to compliment the SE leadership role.\n\nAt least 4 to 5 years of direct experience (in the past 8-10 years) in the following areas of sales motion:\n\nCustomer facing skills\nAbility to deliver technical product presentations\nAbility to demonstrate technical products and their feature sets\nAbility to conduct product proof-of-concepts from initial requirements gathering to successfully achieving objectives and success criteria through clear planning and methodical execution\n\nDatabase, Operating System Platform, and Software skills: At least 4 to 5 years of direct experience (in the past 8-10 years) in the following areas:\n\nHands-on experience in PostgreSQL or EDB Postgres databases or Oracle databases.\nRelational database experience (PostgreSQL, MySQL, Oracle, SQL Server). Active use or, administration of such database(s);\nGood understanding of NoSQL, unstructured data store concepts and familiarity with MongoDB, Hadoop, Cassandra etc.\nGood knowledge of SQL, and SQL query tuning & debugging techniques\nDB server tuning and debugging experience\nBasic to intermediate Linux system administration experience\nSoftware installation & software troubleshooting experience\n\nGood understanding and hands-on experience of the following concepts in relation to PostgreSQL or EDB Postgres or Oracle:\n\nHigh Availability\nUpgrades/patching\nScalability\nPerformance\nSecurity & related concepts\n\nPersonal attributes:\nMotivated self-starter and self-learner\nTeam player with on-site partner/channels ecosystem, customers and remote EDB teams\nKeen to travel and spend time in the field with customers, partners, System Integrators\n\nDesirable Qualifications:\nFoundational and/or experience in the following areas:\nCloud skills:\nPrivate/Public/Hybrid Clouds - AWS, Azure, Google Cloud, VMWare Cloud, and OpenStack, Virtualization - in relation to the databases\nContainers (Docker), Microservices, PaaS (Kubernetes, OpenShift) - In relation to Databases\n\nProgramming skills:\nUnderstanding of (and able to write) SQL, PL/SQL or PL/pgSQL\nUnderstanding of (and able to write) bash shell or Python scripts\n\nTechnical content development skills:\nAbility to author solution collaterals and describe product features in response to the Request For Proposals.\nAbility to coordinate Professional Services deliverables between Delivery and Solution Architect teams and customer teams.\n\nWe know it takes a unique mix of people and skills to help us in our mission to supercharge Postgres, and we understand that not everyone will check every box. We’d love to hear from you and we want you to apply!\n\nEDB is proud to be an equal opportunity workplace. We celebrate diversity and are committed to creating an inclusive environment for all employees. EDB was built on a commitment to trust and respect each other and to embrace an array of people and ideas. These values remain at the center of our culture and are key to our company’s integrity.", "location": {"suburb": "Australia", "state": null, "postcode": null, "description": null}, "link": "https://au.indeed.com/viewjob?jk=58c6b9f7879d8650", "reference": "indeed", "activeStatus": true, "categories": []}, {"title": "Office Assistant - Bowral", "id": "b04d6f83201e2284", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "Secretaries.com.au", "id": "1", "logo": null}, "positions": ["partTime"], "salary": null, "datePosted": null, "dateExpiring": null, "description": "#20100514\n20 May 2021\n\nOffice Assistant - Bowral\nNorthrop Consulting Engineers Pty Ltd\nBowral NSW 2576, Australia\nOffice Coordinator - Bowral\nOffice Coordination – Finance Administration - Reception\nThe Company\nNorthrop Consulting Engineers is an employee owned, multi-discipline consultancy that has been established for over 40 years. We have an open management structure that embodies a diverse, inclusive and flexible workforce for all our employees.\nWe currently employ over 350 staff across eight offices in NSW, ACT, QLD, and VIC. We are essentially a people business that grows by creating opportunities for our people to help build the business and their career. When you join Northrop, you join a company that will support you to excel both professionally and personally.\nThe Role\nOur Bowral office is in search of a tech savvy and motivated individual who is keen to learn, grow and make this role their own!\nThis is a varied position in our Bowral office with the successful candidate working across the office coordination, finance administration, data entry and general reception duties.\nThis position is a part-time position.\nBased in our Bowral office, you will be joining a close knit team and will enjoy operating with an appropriate level of autonomy reporting to the Office Manager.\nDay to day responsibilities include:\nFinance Administration as required\nAssisting with reception and other administrative duties.\nCalling clients and maintaining correspondence and payments.\nProject delivery/close out support\nOnboarding and Offboarding of employees\nEvent coordination\nApplying\nReady to take the next career step and develop to your full potential? Please click the ‘Apply’ button to complete your application. To learn more about this position please email careers@northrop.com.au\nNorthrop is an equal opportunity employer.\n***No agencies please. Applications are sought from direct applicants only.", "location": {"suburb": "Bowral", "state": "NSW", "postcode": "2576", "description": null}, "link": "https://au.indeed.com/viewjob?jk=b04d6f83201e2284", "reference": "indeed", "activeStatus": true, "categories": []}, {"title": "Lead Data Engineer", "id": "748c036effea61ac", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "Tripadvisor", "id": "1", "logo": null}, "positions": [], "salary": null, "datePosted": null, "dateExpiring": null, "description": "Lead Data Engineer, Sydney, Viator\n\n\nWho we are\n\n\nAt Tripadvisor, we believe there’s good out there. We understand that travel brings out the best in us, while lifting deserving businesses and strengthening the communities we meet along the way. We know that as the world’s largest travel site, we’re here to inspire and empower people to explore our world with confidence — and share their trip experiences with others. And every day, we see our ideas come to life in work that enables travellers to discover all the good the world has to offer. As part of the Tripadvisor team, you’ll have the opportunity to do the same.\n\nThis is an exciting opportunity to join the Viator engineering team in Sydney, Australia. Viator is a world leading marketplace for experiences and is part of TripAdvisor, the world’s largest travel site. The Viator team consists of world-class experts in SEO, usability, marketing, and of course, technology. Bring your skills and enthusiasm to this collaborative team.\n\nThe role will see you defining and implementing our data strategy within our marketplace platform that connects tour operators, travellers and third party distributors, including e-Commerce websites and multiple backend systems. You will work alongside our agile development teams using the latest technologies to deliver solutions in a fast paced and complex environment. If you are looking to be challenged technically and have fun, this is the place for you!\n\nMore about you\n\n\nOn your first day, we'd love for you to have:\n\n\nExpertise and industry experience working with data warehouses, data lakes and reporting tools.\nExperience building data pipelines and streaming / processing large amounts of data to / from cloud environments.\nAn understanding of CI/CD approach to platform builds.\nA history of researching and trying out new technologies.\nAn understanding of software development fundamentals: testability, performance, simplicity - in essence, clean code.\nA passion for working within a team (we prize our team culture) and the ability to work more autonomously from time to time.\nThe ability to lead both the business and delivery through strong engagement and influencing skills.\nEagerness to learn our business domain (without understanding our domain, we can’t get information from our data).\n\n\nIt would be nice if you have:\n\n\nExperience with one or more prominent languages such as Java, Python, Bash, C#.\nIndustry experience with public cloud offerings (e.g., AWS, Azure, Google Cloud Platform).\nExperience leveraging machine learning to solve real problems.\nAn interest or involvement in open source software.\nA degree in computer science or a related field (Science, Mathematics etc.).\nA love of travel is not required, but hey - why not?", "location": {"suburb": "Sydney", "state": "NSW", "postcode": null, "description": null}, "link": "https://au.indeed.com/viewjob?jk=748c036effea61ac", "reference": "indeed", "activeStatus": true, "categories": []}, {"title": "Quality Engineer - Manufacturing", "id": "2242102227d931a5", "externalId": null, "workingVisa": null, "visaSubclass": null, "company": {"name": "Saluda Medical", "id": "1", "logo": null}, "positions": [], "salary": null, "datePosted": null, "dateExpiring": null, "description": "We are looking for a Quality Manufacturing Engineer to ensure the appropriate quality controls, improvements and production related quality systems are effectively implemented in our manufacturing facilities. In parallel, this person shall ensure the products are developed in accordance with applicable regulatory requirements, customer expectations and industry standards.\n\n\nAbout you:\nIdeally you have a mechanical and/or electrical engineering background. You are known for your strong problem-solving skills and for your attention to detail. You can be flexible, able to work in a matrix environment. You love to share your knowledge and mentor or support others when needed.\nAbove all, you enjoy the prospect of bringing your skills to a company that prides itself on making a difference to people’s lives.\n\n\nAbout Saluda Medical:\n\nWe are a medical device company developing advanced neuromodulation systems for the next generation of implantable stimulation devices. We are a cutting edge, progressive Australian based company with offices and employees based in Europe and the USA. We are at the forefront of spinal cord stimulation technologies for the management of chronic pain.\n\n\nOur team is made up of world-class engineers, clinicians and seasoned professionals with experience in bringing medical technologies to life.\n\n\nAbout the role:\n\nProject focus\n\nThe initial focus of this role will be to develop the in house testing capability with various industry standard machines, such as the Vision System and Force Gauge.\nProgramming of the Vision System (Micro-vu)\n\n\nGeneral\n\nDevelop test methods/procedures to support product acceptance activities.\nSupport DMR and DHF compliance assessments to ensure quality and regulatory requirements are successfully implemented and maintained\nContinually assess the end to end process to ensure efficient, effective, predictable and timely quality control activities and provide metrics for Data Analysis and Management Review.\nEnsure appropriate testing methodologies and processes are used and validated, develop novel methodologies when needed, this includes procuring equipment when necessary.\nEnsure prompt investigation and action, and escalate quality issues based on appropriate analysis.\nInitiate NCR and CAPA investigation and take actions as required including driving engineering change order to completion.\nAssist development and maintenance of Manufacturing Quality Plans for quality control to ensure manufacturing process and product conformance.\nReview and approve product design related protocols and reports on behalf of quality and regulatory to support regulatory submissions, as required.\nMentor QC inspectors & provide test method training\nParticipate in internal audits to ensure company's quality system is effective.\n\n\nEssential Requirements:\n\nA Bachelor's degree or higher in Electrical Engineering or Mechanical Engineering or related discipline.\nExperience with Micro-vu programming\nAutomated inspection instrument experience\nProven self-starter/able to take initiative\nCritical thinker with High-level analytical and problem-solving skills\nExperience mentoring others\nExperience in Test Method development and Validations\nDetailed oriented\nAdvanced written and verbal communication skills and ability to produce reports & presentations to a professional standard.\nGood time-management skills\nGreat interpersonal skill\nAbility to work in a team and with minimum supervision.\nKnowledge of medical device regulatory requirements\nExperience in medical device industry\n\n\nDesirable Requirements:\n\nProduct lifecycle management system development\nAn understanding of the requirements of ISO 13485:2016 and/or 21CFR 820", "location": {"suburb": "Sydney", "state": "NSW", "postcode": null, "description": null}, "link": "https://au.indeed.com/viewjob?jk=2242102227d931a5", "reference": "indeed", "activeStatus": true, "categories": []}]